//CHK      JOB 1,CLASS=C
//CHK      EXEC PGM=IKJEFT01,REGION=6M
//SYSEXEC  DD DSN=VENDOR.CLIST,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//SYSTSIN  DD *,SYMBOLS=CNVTSYS
%CHK &SYSUID ZOAU1
%CHK &SYSUID ZOAU2
