//TEST      JOB 1
//COMBINE   EXEC  PGM=ICETOOL
//TOOLMSG   DD  SYSOUT=*
//DFSMSG    DD  SYSOUT=*
//IN1 DD *
Y12 89503 MKT
Y12 57301 MKT
Z35 02316 DEV
Y12 91073 MKT
Z35 18693 DEV
//IN2 DD *
89503 27M $9,185,354 SAN JOSE   CA
72135 08M   $317,632 BOSTON     MA
18693 10M $8,732,105 BUFFALO    NY
57301 50M    $30,000 NEWARK     NJ
//TEMP1 DD DSN=&&TEMP1,DISP=(MOD,PASS),SPACE=(TRK,(5,5)),UNIT=SYSDA
//COMBINE DD SYSOUT=*
//TOOLIN   DD *
* REFORMAT THE FILE1 RECORDS FOR SPLICING
  COPY FROM(IN1) TO(TEMP1) USING(CTL1)
* REFORMAT THE FILE2 RECORDS FOR SPLICING
  COPY FROM(IN2) TO(TEMP1) USING(CTL2)
* SPLICE THE NEEDED DATA FROM FILE1 AND FILE2 TOGETHER
  SPLICE FROM(TEMP1) TO(COMBINE) ON(5,5,ZD) WITH(15,17)
//CTL1CNTL DD *
  OUTREC FIELDS=(1,14,      FILE1 DATA
                 31:X)      ADD BLANKS FOR SPLICED FILE2 DATA
//CTL2CNTL DD *
  OUTREC FIELDS=(5:1,5,     PUT FILE2 KEY IN SAME PLACE AS FILE1 KEY
                 15:7,15,   FILE2 DATA
                 30:33,2)   FILE2 DATA
/*
