//CHK      JOB 1,CLASS=C
//CHK      EXEC PGM=IKJEFT01,REGION=6M
//SYSEXEC  DD DSN=VENDOR.CLIST,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//SYSTSIN  DD *,SYMBOLS=CNVTSYS
%CHK &SYSUID REXX1
%CHK &SYSUID REXX2
%CHK &SYSUID CBL1
%CHK &SYSUID ZCLI1
%CHK &SYSUID ANSB1
%CHK &SYSUID ANSB2
