//WELCOME  JOB 1,NOTIFY=&SYSUID
//CLEANUP  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *,SYMBOLS=CNVTSYS
  DELETE &SYSUID..WELCOME
  SET MAXCC=0
//README   EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=MTM2020.PUBLIC.INPUT(WELCOME),DISP=SHR
//SYSUT2   DD DSN=&SYSUID..WELCOME,DISP=(,CATLG,DELETE),UNIT=SYSDA,
//         DCB=(LRECL=80,RECFM=FB,DSORG=PS),SPACE=(TRK,1)
//SYSIN    DD DUMMY
